print("hello world")
n = 23
b = int(input("введите Б"))
c = float(input('число с точкой')) 
print(f'{n}')

# арифмет

#  / деление с точкой
#  // деление для целых
#  ** возведение в степень
#
#  b = round (операция , количество знаков)
#

# логика

# and
# or
# not

# принадлежность

# in  что-то внутри... 
# not in  нет ли этого внутри...

# тождественность

# is - 2 is 2 - true
# is not - не является


# ветвление

#if условие:
#    оператор

#elif условие2:   - новый синт
#    оператор
#else:
#    оператор


# у while тоже есть else


# for i in что-то - коллекция, массив
#   операции...


# r = range (10) от 0 до 9 можно и диапазон (1, 5) 3й аргумент приращение шаг (1, 10, 2)

# for i in range(10) 


# строки

# text = "тест строки"
# print(len(text)) - len - длинна строки
# text. - точка выводит все операции 

#  можно обращаться как к массивам
# text[0]
# text[len(text)-1] последний
# text[-5] пятый с конца
# text[:2] первые два,  полный вид [0:2]


# списки 
# spick = [1,2,3,4,5] 
# spick2 = list(range())  - или заранее определить range и дать определению
#                          ипользуется приведение типов (list(range))  
# spick. - точка действия
# spick.append(что-то) добавление
# spick.remove(что-то) удаление del spick[0] - тоже

# функции
# def имя_функции (аргумент): 
#       тело метода
#
# 
# когда нужен return

